budevg/lpc2148/usb_eth/src/lpc2000/io.h
#ifndef LPC2000_IO_H
#define LPC2000_IO_H

#define BIT0  0x00000001
#define BIT1  0x00000002
#define BIT2  0x00000004
#define BIT3  0x00000008
#define BIT4  0x00000010
#define BIT5  0x00000020
#define BIT6  0x00000040
#define BIT7  0x00000080
#define BIT8  0x00000100
#define BIT9  0x00000200
#define BIT10 0x00000400
#define BIT11 0x00000800
#define BIT12 0x00001000
#define BIT13 0x00002000
#define BIT14 0x00004000
#define BIT15 0x00008000
#define BIT16 0x00010000
#define BIT17 0x00020000
#define BIT18 0x00040000
#define BIT19 0x00080000
#define BIT20 0x00100000
#define BIT21 0x00200000
#define BIT22 0x00400000
#define BIT23 0x00800000
#define BIT24 0x01000000
#define BIT25 0x02000000
#define BIT26 0x04000000
#define BIT27 0x08000000
#define BIT28 0x10000000
#define BIT29 0x20000000
#define BIT30 0x40000000
#define BIT31 0x80000000

#define false 0
#define true 1

#include <lpc2000/lpc214x.h>

/* Bit name definitions for various SFRs */

#define SCS_GPIO0M BIT0
#define SCS_GPIO1M BIT1

#define PIN0  BIT0
#define PIN1  BIT1
#define PIN2  BIT2
#define PIN3  BIT3
#define PIN4  BIT4
#define PIN5  BIT5
#define PIN6  BIT6
#define PIN7  BIT7
#define PIN8  BIT8
#define PIN9  BIT9
#define PIN10 BIT10
#define PIN11 BIT11
#define PIN12 BIT12
#define PIN13 BIT13
#define PIN14 BIT14
#define PIN15 BIT15
#define PIN16 BIT16
#define PIN17 BIT17
#define PIN18 BIT18
#define PIN19 BIT19
#define PIN20 BIT20
#define PIN21 BIT21
#define PIN22 BIT22
#define PIN23 BIT23
#define PIN24 BIT24
#define PIN25 BIT25
#define PIN26 BIT26
#define PIN27 BIT27
#define PIN28 BIT28
#define PIN29 BIT29
#define PIN30 BIT30
#define PIN31 BIT31

#endif
